README.org
** Desktop Environment
   Load up the desktop environment if on a machine that supports it and the ~--use-exwm~ argument was passed into Emacs on startup.
*** Window Managment
    Emacs is the desktop window manager provided by EXWM.
    #+begin_src emacs-lisp :tangle init.el
      (use-package exwm
	:init
	(setq mouse-autoselect-window t
	      focus-follows-mouse t
	      exwm-workspace-warp-cursor t)
	:config
	(require 'exwm-config)
	(fringe-mode 2)
	(setq exwm-workspace-show-all-buffers t)
	(setq exwm-layout-show-all-buffer t)
	(add-hook 'exwm-update-class-hook
		  (lambda ()
		    (exwm-workspace-rename-buffer exwm-class-name)))

	(exwm-enable))

  
    #+end_src
*** Helper Functions
    #+begin_src emacs-lisp :tangle init.el
      (defun exwm/run-in-background (command)
	(let ((command-parts (split-string command "[ ]+")))
	  (apply #'call-proces `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

      (defun exwm/bind-function (key invocation &rest bindings)
	"Bind KEYs to FUNCTIONs globally"
	(while key
	  (exwm-input-set-key (kbd key)
			      `(lambda ()
				 (interactive)
				 (funcall ',invocation)))
	  (setq key (pop bindings)
		invocation (pop bindings))))

      (defun exwm/bind-command (key command &rest bindings)
	"Bind KEYs to COMMANDs globally"
	(while key (exwm-input-set-key (kbd key)
				       `(lambda ()
					  (interactive)
					  (exwm/run-in-background ,command)))
	       (setq key (pop bindings)
		     command (pop bindings))))
    #+end_src
** UI Configuration
*** Basics
    #+begin_src emacs-lisp :tangle init.el 
      (setq inhibit-startup-message t)

      (scroll-bar-mode -1)
      (tool-bar-mode -1)
      (tooltip-mode -1)
      (set-fringe-mode 10)

      (menu-bar-mode -1)

      (setq visible-bell t)

      (column-number-mode)
      (global-display-line-numbers-mode t)

      (dolist (mode '(org-mode-hook
		      term-mode-hook
		      shell-mode-hook
		      treemacs-mode-hook
		      eshell-mode-hook))
	(add-hook mode (lambda () (display-line-numbers-mode 0))))
    #+end_src
** Keybindings
*** ESC cancels all
   #+begin_src emacs-lisp :tangle init.el
     ;; Make ESC quit prompts
     (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
   #+end_src
*** Evil
    #+begin_src emacs-lisp :tangle init.el
      (defun jak/evil-hook ()
	(dolist (mode '(custom-mode
			eshell-mode
			git-rebase-mode
			erc-mode
			circe-server-mode
			circe-chat-mode
			circe-query-mode
			sauron-mode
			term-mode))
	  (add-to-list 'evil-emacs-state-modes mode)))

      (use-package evil
	:init
	(setq evil-want-intergration t)
	(setq evil-want-keybinding nil)
	(setq evil-want-C-u-scroll t)
	(setq evil-want-C-i-jump nil)
	(setq evil-respect-visual-line-mode t)
	:config
	(add-hook 'evil-mode-hook 'jak/evil-hook)
	(evil-mode 1)
	(define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
	(define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backwards-char-and-join)

	;; Use visual line motions even outside of visual-line-mode buffers
	(evil-global-set-key 'motion "j" 'evil-next-visual-line)
	(evil-global-set-key 'motion "k" 'evil-previous-visual-line)


	(evil-set-initial-state 'org-src-mode 'insert)
	(evil-set-initial-state 'messages-buffer-mode 'normal)
	(evil-set-initial-state 'dashboard-mode 'normal))

      (use-package evil-collection
	:after evil
	:custom
	(evil-collection-outline-bind-tab-p nil)
	:config
	(evil-collection-init))

    #+end_src
*** Which-key
    Provids a keybinding panel to show possible further key combonation.
    #+begin_src emacs-lisp :tangle init.el
      (use-package which-key
	:init (which-key-mode)
	:diminish which-key-mode
	:config
	(setq which-key-idle-delay 0.2))
    #+end_src
*** General
    [[https://github.com/noctuid/general.el][general.el]] is a library for defining prefixed keybindings, especially in Evil mode.
    #+begin_src emacs-lisp :tangle init.el
      (use-package general
	:config
	(general-evil-setup t)

	(general-create-definer jak/leader-key-def
	  :keymaps '(normal insert visual emacs)
	  :prefix "SPC"
	  :global-prefix "C-SPC")

	(general-create-definer jak/ctrl-c-keys
	  :prefix "C-c"))
    #+end_src
** General Configuration
*** User Interface
    Clean up Emacs user interface and make it more minimal
    #+begin_src emacs-lisp :tangle init.el
      (setq inhibit-startup-message t)

      (scroll-bar-mode -1)
      (tool-bar-mode -1)
      (tool-tip-mode -1)
      (set-fringe-mode 10)

      (menu-bar-mode -1)

      (setq visible-bell t)
    #+end_src
    Improve scrolling
    #+begin_src emacs-lisp :tangle init.el
      (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
      (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
      (set-frame-parameter (select-frame) 'fullscreen 'maxmimized)
      (add-to-list 'default-frame-alist '(fullscreen . maximized))
    #+end_src
    
    Enable line numbers and customize their format.
    #+begin_src emacs-lisp :tangle init.el
      (column-number-mode)
    
      ;; Enable line numbers for some modes
      (dolist (mode '(text-mode-hook
    		  prog-mode-hook
    		  conf-mode-hook))
        (add-hook mode (lambda () (display-line-numbers-mode 1))))
    
      (dolist (mode '(org-mode-hook))
        (add-hook mode (lambda () (display-line-numbers-mode 0))))
    #+end_src

    Don't warn for large files, like when launching videos
    #+begin_src emacs-lisp :tangle init.el
      (setq large-file-warning-threshold nil)
    #+end_src

    Don't warn for following symlinked files
    #+begin_src emacs-lisp :tangle init.el
      (setq vc-follow-symlinks t)
    #+end_src

    Don't warn when advice is added for functions
    #+begin_src emacs-lisp :tangle init.el
      (setq ad-redefinition-action 'accept)
    #+end_src
*** Theme
    #+begin_src emacs-lisp :tangle init.el
      (use-package doom-themes : defer t)
      (load-theme 'doom-palenight t)
      (doom-themes-visual-bell-config)
    #+end_src
*** Font
    #+begin_src emacs-lisp :tangle init.el
      (defvar jak/default-font-size 180)
      (defvar jak/default-font-variable-font-size 180)

      (defvar jak/frame-transparency '(90 . 90))

      (set-face-attribute 'default nil
			  :font "Fira Code"
			  :height (jak/system-settings-get 'emacs/default-face-size))

      (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height jak/default-font-size)
      (set-face-attribute 'variable-pitch nil :font "Cantarell" :height jak/default-variable-font-size :weight 'regular)
    #+end_src
*** Mode Line
**** Basic Customization
    #+begin_src emacs-lisp :tangle init.el
      (setq display-time-format "%l:%M %p %b %y"
	    display-time-default-load-average nil)
    #+end_src
**** Enable Mode Diminishing
    The [[https://github.com/myrjola/diminish.el][diminish]] package hides minor modes from the modelines.
    #+begin_src emacs-lisp :tangle init.el
      (use-package diminish)
    #+end_src
**** Doom Modeline
    #+begin_src emacs-lisp :tangle init.el
      (use-package minions
	:hook (doom-modeline-mode . minions-mode)
	:custom
	(minions-mode-line-lighter " "))

      (use-package doom-modeline
	:after eshell
	:hook (after-init . doom-modeline-init)
	:custom-face
	(mode-line ((t (:height 0.85))))
	(mode-line-inactive ((t (:height 0.85))))
	:custom
	(doom-modeline-height 15)
	(doom-modeline-bar-width 6)
	(doom-modeline-lsp t)
	(doom-modeline-github nil)
	(doom-modeline-mu4e nil)
	(doom-modeline-irc nil)
	(doom-modeline-minor-modes t)
	(doom-modeline-persp-name nil)
	(doom-modeline-buffer-file-name-style 'truncate-except-project)
	(doom-modeline-major-mode-icon nil))
    #+end_src
*** Notifications
   [[https://github.com/jwiegley/alert][alert]] is a library for showing notifications from other packages in a variety of ways.
   For now I just use it to surface desktop notifications from package code.
   #+begin_src emacs-lisp :tangle init.el
     (use-package alert
       :commands alert
       :config
       (setq alert-default-style 'notifications))
   #+end_src
*** TODO Auto-Saving Changed Files
   #+begin_src emacs-lisp 
     (use-package super-save
       :config
       (super-save-mode +1))
   #+end_src
*** Auto-reverting
    #+begin_src emacs-lisp :tangle init.el
      (global-auto-revert-mode 1)
    #+end_src
*** TODO UI Toggles
    #+begin_src emacs-lisp :tangle init.el
      (jak/leader-key-def
       "t" '(:ignore t :which-key "toggles")
       "tw" 'whitespace-mode
       "tt" (counsel-load-theme :which-key "choose theme"))
    #+end_src
*** Highlight Matching Braces
    #+begin_src emacs-lisp :tangle init.el
      (use-package paren
	:config
	(set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
	(show-paren-mode 1))
    #+end_src
*** Tramp
    #+begin_src emacs-lisp :tangle init.el
      (setq tramp-default-method "ssh")
    #+end_src
*** Emacs as External Editor
    #+begin_src emacs-lisp :tangle init.el
      (defun jak/show-server-edit-buffer (buffer)
	;; TODO: Set a transient keymap to close with 'C-c C-c'
	(split-window-vertically -15)
	(other-window 1)
	(set-buffer buffer))

      (setq server-window #'jak/show-server-edit-buffer)
    #+end_src
** Editing Configuration
*** Tab Widths
    #+begin_src emacs-lisp :tangle init.el
      (setq-default tab-width 2)
      (setq-default evil-shift-width tab-width)
    #+end_src
*** Use spaces instead of tabs
    #+begin_src emacs-lisp :tangle init.el
      (setq-default indent-tabs-mode nil)
    #+end_src
*** Commenting Lines
    #+begin_src emacs-lisp :tangle init.el
      (use-package evil-nerd-commenter
	:bind ("M-/" . evilnc-comment-or-uncomment-lines))
    #+end_src
*** Automatically clean whitespace
    #+begin_src emacs-lisp :tangle init.el
      (use-package ws-butler
	:hook ((text-mode . ws-butler-mode)
	       (prog-mode . ws-butler-mode)))
    #+end_src
