init.el

(defun jak/org-file-jump-to-heading (org-file heading-title)
  (interactive)
  (find-file (expand-file-name org-file))
  (goto-char (point-min))
  (search-forward (concat "* " heading-title))
  (org-overview)
  (org-reveal)
  (org-show-subtree)
  (forward-line))

(defun jak/org-file-show-headings (org-file)
  (interactive)
  (find-file (expand-file-name org-file))
  (counsel-org-togo)
  (org-overview)
  (org-reveal)
  (org-show-subtree)
  (forward-line))

(setq-default fill-column 100)

(defun jak/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (visual-line-mode 1)
  (setq evil-auto-indent nil)
  (diminish org-indent-mode))

(use-package org
  :defer t
  :hook (org-mode . jak/org-mode-setup)
  :config
  (setq org-ellipsis " ▾"
	org-hide-emphasis-markers t
	org-src-fontify-natively t
	org-src-tab-acts-natively t
	org-edit-src-content-indentation 2
	org-hide-block-startup nil
	org-src-preserve-indentation nil
	org-startup-folded 'content
	org-cycle-separator-lines 2)

  (setq org-modules
	'(org-crypt
	  org-habit
	  org-bookmark
	  org-eshell
	  org-irc))

  (setq org-refile-targets '((nil :maxlevel . 2)
			     (org-agenda-files :maxlevel . 2)))

  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-use-outline-path t)

  (evil-define-key '(normal insert visual) org-mode-map (kbd "C-j") 'org-next-visible-heading)
  (evil-define-key '(normal insert visual) org-mode-map (kbd "C-k") 'org-previous-visible-heading)
  (evil-define-key '(normal insert visual) org-mode-map (kbd "M-j") 'org-metadown)
  (evil-define-key '(normal insert visual) org-mode-map (kbd "M-k") 'org-metaup)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (ledger . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes)
  ;; Inserting sections below this for org-mode
  ;; ) ;; Uncomment this line if this is the last block for org-mode

(setq org-directory "~/org")

(defun jak/org-path (path)
  (expand-file-name path org-directory))

(setq org-default-notes-file (jak/org-path "Inbox.org"))

(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
	(sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANCEL(k@)")))

(setq org-tag-alist
      '((:startgroup)
	 ;Put mutually exclusive tags here
	(:endgroup)
	("@home" . ?H)
	("@work" . ?W)
	("batch" . ?b)
	("followup" . ?f)))

(setq org-agenda-window-setup 'current-window)
(setq org-agenda-span 'day)
(setq org-agenda-start-with-log-mode t)

(setq org-agenda-custom-commands
      `(("d" "Dashboard"
	 ((agenda "" ((org-deadline-warning-days 7)))
	  (tags-todo "+PRIORITY=\"A\""
		     ((org-agenda-overriding-header "High Priority")))
	  (tags-todo "+followup" ((org-agenda-overriding-header "Needs Follow Up")))
	  (todo "NEXT"
		((org-agenda-overriding-header "Next Action")))
	  (todo "TODO"
		((org-agenda-overriding-header "Unprocessed Inbox Tasks")
		 (org-agenda-files '(,(jak/org-path "Inbox.org")))
		 (org-agenda-text-search-extra-files nil)))))
	("n" "Next Tasks"
	 ((agenda "" ((org-deadline-warning-days 7 )))
	  (todo "NEXT"
		((org-agenda-overriding-header "Next Tasks")))))
	("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
	 ((org-agenda-overriding-header "Low Effort Tasks")
	  (org-agenda-max-todos 20)
	  (org-agenda-files org-agenda-files)))))

(defun jak/get-todays-journal-file-name ()
  "Gets the journal file name for today's date"
  (interactive)
  (let* ((journal-file-name
	  (expand-file-name
	   (format-time-string "%Y/%Y-%2m-%B.org")
	   (jak/org-path "Journal/")))
	 (journal-year-dir (file-name-directory journal-file-name)))
    (if (not (file-directory-p journal-year-dir))
	(make-directory journal-year-dir))
    journal-file-name))

(defun jak/on-org-capture ()
  (setq header-line-format nil)

  (let ((template (org-capture-get :key t)))
    (pcase template
      ("jj" (delete-other-windows)))))

(add-hook 'org-capture-mode-hook 'jak/on-org-capture)

(setq org-capture-templates
      `(("t" "Task")
	("tt" "Task" entry (file ,(jak/org-path "Inbox.org"))
	 "* TODO %?\n %U\n %a\n %i" :empty-lines 1)
	("ts" "Clocked Entry Subtask" entry (clock)
	 "* TODO %?\n %U\n %a\n %i" :empty-lines 1)

	("j" "Journal Entries")
	("je" "General Entry" entry
	 (file+olp+datatree ,(jak/org-path "Journal.org"))
	 "\n* %<%I:%M %p> - %^{Title} \n\n%?\n\n"
	 :tree-type week
	 :clock-in :clock-resume
	 :empty-lines 1)
	("jt" "Task Entry" entry
	 (file+olp+datatree ,(jak/org-path "Journal.org"))
	 "\n* %<%I:%M %p> - Task Notes: %a\n\n%?\n\n"
	 :tree-type week
	 :clock-in :clock-resume
	 :empty-lines 1)
	("jj" "Journal" entry
	 (file+olp+datetree ,(jak/org-path "Journal.org"))
	 "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
	 :tree-type week
	 :clock-in :clock-resume
	 :empty-lines 1)))

(setq org-src-window-setup 'current-window)

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("el"  . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("nix" . "src nix"))

(defun jak/search-org-files ()
  (interactive)
  (counsel-rg "" "~/Notes" nil "Search Notes: "))

(use-package evil-org
  :after org
  :hook ((org-mode . evil-org-mode)
	 (org-agenda-mode . evil-org-mode)
	 (evil-org-mode . (lambda () (evil-org-set-key-theme '(navigation todo insert textobjects additional)))))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(jak/leader-key-def
 "o"    '(:ignore t :which-key "org mode")

 "oi"   '(:ignore t :which-key "insert")
 "oil"  '(org-insert-link :which-key "insert link")

 "on"   '(org-toggle-narrow-to-subtree :which-key "toggle narrow")

 "os"   '(jak/counsel-rg-org-files :which-key "search notes")

 "oa"   '(org-agenda :which-key "status")
 "oc"   '(org-capture t :which-key "capture")
 "ox"   '(org-export-dispatch t :which-key "export"))

(defun jak/org-babel-tangle-dont-ask ()
  (let ((org-confirm-babel-evaluate nil))
    (org-babel-tangle)))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'jak/org-babel-tangle-dont-ask
					      'run-at-end 'only-in-org-mode)))

;; This in it's one block for org-mode reasons
)

(use-package magit
  :commands (magit-status magit-get-current-branch)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package evil-magit
  :after magit)

(global-set-key (kbd "C-M-;") 'magit-status)

(jak/leader-key-def
 "g"    '(:ignore t :which-key "git")
 "gs"   'magit-status
 "gd"   'magit-diff-unstaged
 "gc"   'magit-branch-or-checkout
 "gl"   '(:ignore t :which-key "log")
 "glc"  'magit-log-current
 "glf"  'magit-log-buffer-file
 "gb"   'magit-branch
 "gP"   'magit-push-current
 "gp"   'magit-pull-branch
 "gf"   'magit-fetch
 "gF"   'magit-fetch-all
 "gr"   'magit-rebase)
