README.org
**** magit-todos
     This extension to Magit shows a TODOs section in your git status buffer
     containing all lines with TODO in files contained within the repo. More info in the [[https://github.com/alphapapa/magit-todos][Github repo]].
     #+begin_src emacs-lisp :tangle init.el
       (use-package magit-todos
	 :defer t)
     #+end_src
**** git-link
     #+begin_src emacs-lisp :tangle init.el
       (use-package git-link
	 :commands git-link
	 :config
	 (setq git-link-open-in-browser t)
	 (jak/leader-key-def
	  "gL" 'git-link))
     #+end_src
*** Projectile
**** Initial Setup
     #+begin_src emacs-lisp :tangle init.el
       (use-package projectile
	 :diminish projectile-mode
	 :config (projectile-mode)
	 :bind-keymap
	 ("C-c p" . projectile-command-map)
	 :init
	 (when (file-directory-p "~/projects/")
	   (setq projectile-project-search-path '("~/projects/")))
	 (setq projectile-switch-project-action #'projectile-dired))

       (use-package counsel-projectile
	 :after projectile)

       (jak/leader-key-def
	"pf" 'counsel-projectile-find-file
	"ps" 'counsel-projectile-switch-project
	"pF" 'counsel-projectile-rg
	"pp" 'counsel-projectile
	"pc" 'projectile-compile-project
	"pd" 'projectile-dired)
     #+end_src
*** Languages 
**** Language Server Support
     #+begin_src emacs-lisp :tangle init.el
;;       (use-package ivy-xref
;;	 :init (if (< emacs-major-version 27)
;;		   (setq xref-show-xrefs-functions #'ivy-xref-show-xrefs)
;;		 (setq xref-show-definitions-function #'ivy-xref-show-defs)))

       (use-package lsp-mode
	 :commands lsp
	 :hook ((typescript-mode js2-mode web-mode) . lsp)
	 :bind (:map lsp-mode-map
		     ("TAB" . completion-at-point)))

       (jak/leader-key-def
	"l"  '(:ignore t :which-key "lsp")
	"ld" 'xref-find-definitions
	"lr" 'xref-find-references
	"ln" 'lsp-ui-find-next-reference
	"lp" 'lsp-ui-find-previous-reference
	"ls" 'counsel-imenu
	"le" 'lsp-ui-flycheck-list
	"lS" 'lsp-ui-sideline-mode
	"lx" 'lsp-execute-code-action)

       (use-package lsp-ui
	 :hook (lsp-mode . lsp-ui-mode)
	 :config
	 (setq lsp-ui-sideline-enable t)
	 (setq lsp-ui-sideline-show-hover t)
	 (setq lsp-ui-doc-position 'bottom)
	 (lsp-ui-doc-show))
     #+end_src
**** Meta Lisp
     #+begin_src emacs-lisp :tangle init.el
       (use-package lispy
	 :hook ((emacs-lisp-mode . lispy-mode)
		(scheme-mode     . lispy-mode)))

       (use-package lispyville
	 :disabled
	 :hook ((lispy-mode . lispyville-mode))
	 :config
	 (lispyville-set-key-theme '(operators c-w additional)))
     #+end_src
**** Scheme
     #+begin_src emacs-lisp :tangle init.el
       (use-package scheme-mode
	 :mode "\\.sld\\'")
     #+end_src
**** Emacs Lisp
     #+begin_src emacs-lisp :tangle init.el
       (add-hook 'emacs-lisp-mode-hook #'flycheck-mode)

       (use-package helpful
	 :ensure t
	 :custom
	 (counsel-describe-function-function #'helpful-callable)
	 (counsel-describe-variable-function #'helpful-variable)
	 :bind
	 ([remap describe-function] . counsel-describe-function)
	 ([remap describe-command] . helpful-command)
	 ([remap describe-variable] . counsel-describe-variable)
	 ([remap describe-key] .helpful-key))

       (jak/leader-key-def
	"e"    '(:ignore t :which-key "eval")
	"eb"   '(eval-buffer :which-key "eval buffer"))

       (jak/leader-key-def
	:keymaps '(visual)
	"er" '(eval-region :which-key "eval region"))
     #+end_src
**** Scheme
     #+begin_src emacs-lisp :tangle init.el
       (use-package geiser
	 :ensure t
	 :config
	 (setq geiser-default-implementation 'guile)
	 (setq geiser-active-implementation '(gambit guile))
	 (setq geiser-repl-default-port 44555)
	 (setq geiser-implementations-alist '(((regexp "\\.scm$") gambit)
					       ((regexp "\\.sld") gambit))))
     #+end_src
**** Markdown
     #+begin_src emacs-lisp :tangle init.el
       (use-package markdown-mode
	 :mode "\\.md\\'"
	 :config
	 (setq markdown-command "marked")
	 (defun jak/set-markdown-header-font-sizes ()
	   (dolist (face '((markdown-header-face-1 . 1.2)
			   (markdown-header-face-2 . 1.1)
			   (markdown-header-face-3 . 1.0)
			   (markdown-header-face-4 . 1.0)
			   (markdown-header-face-5 . 1.0)))
	     (set-face-attribute (car face) nil :weight 'normal :height (cdr face))))

	 (defun jak/markdown-mode-hook ()
	   (jak/set-makrdown-header-font-sizes))

	 (add-hook 'markdown-mode-hook 'jak/markdown-mode-hook))
     #+end_src
**** HTML
     #+begin_src emacs-lisp :tangle init.el

     #+end_src
** Productivity
*** Syntax checking with Flycheck
    #+begin_src emacs-lisp :tangle init.el
      (use-package flycheck
	:defer t
	:hook (lsp-mode . flycheck-mode))

    #+end_src
*** Snippets
    #+begin_src emacs-lisp :tangle init.el
      (use-package yasnippet
	:hook (prog-mode . yas-minor-mode)
	:config
	(yas-reload-all))
    #+end_src
*** Smart Parens
    #+begin_src emacs-lisp :tangle init.el
      (use-package smartparens
	:hook (prog-mode . smartparens-mode))
    #+end_src
*** Rainbow Delimiters
    #+begin_src emacs-lisp :tangle init.el
      (use-package rainbow-delimiters
	:hook (prog-mode . rainbow-delimiters-mode))
    #+end_src
*** Rainbow Mode
    Sets the background of HTML color strings in buffers to be the color mentioned.
    #+begin_src emacs-lisp :tangle init.el
      (use-package rainbow-mode
	:defer t
	:hook (org-mode
	       emacs-lisp-mode
	       web-mode
	       typescript-mode
	       js2-mode))
    #+end_src
** Writing (Prose)
*** Darkroom
    #+begin_src emacs-lisp :tangle init.el
      (use-package darkroom
	:commands darkroom-mode
	:config
	(setq darkroom-text-scale-increase 0))

      (defun jak/enter-focus-mode ()
	(interactive)
	(darkroom-mode 1)
	(display-line-numbers-mode 0))

      (defun jak/leave-focus-mode ()
	(interactive)
	(darkroom 0)
	(display-line-numbers 1))

      (defun jak/toggle-focus-mode ()
	(interactive)
	(if (symbol-value darkroom-mode)
	    (jak/leave-focus-mode)
	  (jak/enter-focus-mode)))

      (jak/leader-key-def
       "tf" '(jak/toggle-focus-mode :which-key "focus mode"))
    #+end_src
** Applications
*** Binding Prefix
    #+begin_src emacs-lisp :tangle init.el
      (jak/leader-key-def
       "a" '(:ignore t :which-key "apps"))
    #+end_src
*** Mail
**** TODO mu4e
     #+begin_src emacs-lisp
       (use-package mu4e
	 :config

	 (require 'org-mu4e)
	 (setq mail-user-agent 'mu4e-user-agent)

	 ;; Refresh mail using offlineimap every 10 minutes
	 (setq mu4e-update-interval (* 10 60))
	 (setq mu4e-get-mail-command "offlineimap")
	 (setq mu4e-maildir "~/Mail")

	 ;; Set up contexts for email accounts
	 (setq mu4e-contexts
	       `(,(make-mu4e-context
		   :name "Boldman.co"
     #+end_src
*** Calendar
    [[https://github.com/kiwanami/emacs-calfw][calfw]] is a calendar UI that is able to show all of the scheduled Org Agenda items.
    #+begin_src emacs-lisp :tangle init.el
      (use-package calfw
	:disabled
	:commands cfw:open-org-calendar
	:config
	 (setq cfw:fchar-junction ?╋
	      cfw:fchar-vertical-line ?┃
	      cfw:fchar-horizontal-line ?━
	      cfw:fchar-left-junction ?┣
	      cfw:fchar-right-junction ?┫
	      cfw:fchar-top-junction ?┯
	      cfw:fchar-top-left-corner ?┏
	      cfw:fchar-top-right-corner ?┓)

	 (use-package calfw-org
	   :config
	   (setq cfw:org-agenda-schedule-arg '(:timestamp))))

      (jak/leader-key-def
       "cc"  '(cfw:open-org-calendar :which-key "calendar"))
    #+end_src
*** Finance
    #+begin_src emacs-lisp :tangle init.el
      (use-package ledger-mode
	:mode "\\.lgr\\'"
	:bind (:map ledger-mode-map
		    ("TAB" . completion-at-point))
	:custom
	  (ledger-reports '(("bal" "%(binary) -f %(ledger-file) bal")
			  ("bal this quarter" "%(binary) -f %(ledger-file) --period \"this quarter\" bal")
			  ("bal last quarter" "%(binary) -f %(ledger-file) --period \"last quarter\" bal")
			  ("reg" "%(binary) -f %(ledger-file) reg")
			  ("payee" "%(binary) -f %(ledger-file) reg @%(payee)")
			  ("account" "%(binary) -f %(ledger-file) reg %(account)"))))
    #+end_src
*** EMMS
    #+begin_src emacs-lisp :tangle init.el
      (use-package emms
	:commands emms
	:config
	(require 'emms-setup)
	(emms-standard)
	(emms-default-players)
	(emms-mode-line-disable)
	(setq emms-source-file-default-directory "~/Music")
	(jak/leader-key-def
	 "am"  '(:ignore t :which-key "media")
	 "amp" '(emms-pause :which-key "play / pause")
	 "amf" '(emms-play-file :which-key "play file")))
    #+end_src
** System Utilites
*** Guix 
   #+begin_src emacs-lisp
     (use-package guix
       :defer t)

     (jak/leader-key-def
      "G"  '(:ignore t :which-key "Guix")
      "Gg" '(guix :which-key "Guix")
      "Gi" '(guix-installed-user-packages :which-key "user package")
      "GI" '(guix-installed-system-packages :which-key "system packages")
      "Gp" '(guix-packages-by-name :which-key "search packages")
      "GP" '(guix-pull :which-key "pull"))
   #+end_src
*** Deamons
    #+begin_src emacs-lisp
      (use-package daemons
	:commands daemons)
    #+end_src
*** PulseAudio
    #+begin_src emacs-lisp :tangle init.el
      (use-package pulseaudio-control
	:commands pulseaudio-control-select-sink-by-name
      )
    #+end_src
* Inspiration
  [[https://github.com/emacs-tw/awesome-emacs][Awesome Emacs]] contains a host of packages and themes to check out for your own customizations
  
  Other configurations and repos
  - [[https:https://github.com/daedreth/UncleDavesEmacs/blob/master/config.org][Uncle Dave's emacs]]
  - [[https://github.com/daviwil/][david wilson]]
    - [[https://github.com/daviwil/emacs-from-scratch][emacs from scratch]]: beginner friendly configuration tutorial
    - [[https://github.com/daviwil/dotfiles][dotfiles]] : his working configs, including configs for GUIX
