init.el

(use-package magit-todos
  :defer t)

(use-package git-link
  :commands git-link
  :config
  (setq git-link-open-in-browser t)
  (jak/leader-key-def
   "gL" 'git-link))

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/projects/")
    (setq projectile-project-search-path '("~/projects/")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :after projectile)

(jak/leader-key-def
 "pf" 'counsel-projectile-find-file
 "ps" 'counsel-projectile-switch-project
 "pF" 'counsel-projectile-rg
 "pp" 'counsel-projectile
 "pc" 'projectile-compile-project
 "pd" 'projectile-dired)

;;       (use-package ivy-xref
;;	 :init (if (< emacs-major-version 27)
;;		   (setq xref-show-xrefs-functions #'ivy-xref-show-xrefs)
;;		 (setq xref-show-definitions-function #'ivy-xref-show-defs)))

       (use-package lsp-mode
	 :commands lsp
	 :hook ((typescript-mode js2-mode web-mode) . lsp)
	 :bind (:map lsp-mode-map
		     ("TAB" . completion-at-point)))

       (jak/leader-key-def
	"l"  '(:ignore t :which-key "lsp")
	"ld" 'xref-find-definitions
	"lr" 'xref-find-references
	"ln" 'lsp-ui-find-next-reference
	"lp" 'lsp-ui-find-previous-reference
	"ls" 'counsel-imenu
	"le" 'lsp-ui-flycheck-list
	"lS" 'lsp-ui-sideline-mode
	"lx" 'lsp-execute-code-action)

       (use-package lsp-ui
	 :hook (lsp-mode . lsp-ui-mode)
	 :config
	 (setq lsp-ui-sideline-enable t)
	 (setq lsp-ui-sideline-show-hover t)
	 (setq lsp-ui-doc-position 'bottom)
	 (lsp-ui-doc-show))

(use-package lispy
  :hook ((emacs-lisp-mode . lispy-mode)
	 (scheme-mode     . lispy-mode)))

(use-package lispyville
  :disabled
  :hook ((lispy-mode . lispyville-mode))
  :config
  (lispyville-set-key-theme '(operators c-w additional)))

(use-package scheme-mode
  :mode "\\.sld\\'")

(add-hook 'emacs-lisp-mode-hook #'flycheck-mode)

(use-package helpful
  :ensure t
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] .helpful-key))

(jak/leader-key-def
 "e"    '(:ignore t :which-key "eval")
 "eb"   '(eval-buffer :which-key "eval buffer"))

(jak/leader-key-def
 :keymaps '(visual)
 "er" '(eval-region :which-key "eval region"))

(use-package geiser
  :ensure t
  :config
  (setq geiser-default-implementation 'guile)
  (setq geiser-active-implementation '(gambit guile))
  (setq geiser-repl-default-port 44555)
  (setq geiser-implementations-alist '(((regexp "\\.scm$") gambit)
					((regexp "\\.sld") gambit))))

(use-package markdown-mode
  :mode "\\.md\\'"
  :config
  (setq markdown-command "marked")
  (defun jak/set-markdown-header-font-sizes ()
    (dolist (face '((markdown-header-face-1 . 1.2)
		    (markdown-header-face-2 . 1.1)
		    (markdown-header-face-3 . 1.0)
		    (markdown-header-face-4 . 1.0)
		    (markdown-header-face-5 . 1.0)))
      (set-face-attribute (car face) nil :weight 'normal :height (cdr face))))

  (defun jak/markdown-mode-hook ()
    (jak/set-makrdown-header-font-sizes))

  (add-hook 'markdown-mode-hook 'jak/markdown-mode-hook))



(use-package flycheck
  :defer t
  :hook (lsp-mode . flycheck-mode))

(use-package yasnippet
  :hook (prog-mode . yas-minor-mode)
  :config
  (yas-reload-all))

(use-package smartparens
  :hook (prog-mode . smartparens-mode))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package rainbow-mode
  :defer t
  :hook (org-mode
	 emacs-lisp-mode
	 web-mode
	 typescript-mode
	 js2-mode))

(use-package darkroom
  :commands darkroom-mode
  :config
  (setq darkroom-text-scale-increase 0))

(defun jak/enter-focus-mode ()
  (interactive)
  (darkroom-mode 1)
  (display-line-numbers-mode 0))

(defun jak/leave-focus-mode ()
  (interactive)
  (darkroom 0)
  (display-line-numbers 1))

(defun jak/toggle-focus-mode ()
  (interactive)
  (if (symbol-value darkroom-mode)
      (jak/leave-focus-mode)
    (jak/enter-focus-mode)))

(jak/leader-key-def
 "tf" '(jak/toggle-focus-mode :which-key "focus mode"))

(jak/leader-key-def
 "a" '(:ignore t :which-key "apps"))

(use-package calfw
  :disabled
  :commands cfw:open-org-calendar
  :config
   (setq cfw:fchar-junction ?╋
	cfw:fchar-vertical-line ?┃
	cfw:fchar-horizontal-line ?━
	cfw:fchar-left-junction ?┣
	cfw:fchar-right-junction ?┫
	cfw:fchar-top-junction ?┯
	cfw:fchar-top-left-corner ?┏
	cfw:fchar-top-right-corner ?┓)

   (use-package calfw-org
     :config
     (setq cfw:org-agenda-schedule-arg '(:timestamp))))

(jak/leader-key-def
 "cc"  '(cfw:open-org-calendar :which-key "calendar"))

(use-package ledger-mode
  :mode "\\.lgr\\'"
  :bind (:map ledger-mode-map
	      ("TAB" . completion-at-point))
  :custom
    (ledger-reports '(("bal" "%(binary) -f %(ledger-file) bal")
		    ("bal this quarter" "%(binary) -f %(ledger-file) --period \"this quarter\" bal")
		    ("bal last quarter" "%(binary) -f %(ledger-file) --period \"last quarter\" bal")
		    ("reg" "%(binary) -f %(ledger-file) reg")
		    ("payee" "%(binary) -f %(ledger-file) reg @%(payee)")
		    ("account" "%(binary) -f %(ledger-file) reg %(account)"))))

(use-package emms
  :commands emms
  :config
  (require 'emms-setup)
  (emms-standard)
  (emms-default-players)
  (emms-mode-line-disable)
  (setq emms-source-file-default-directory "~/Music")
  (jak/leader-key-def
   "am"  '(:ignore t :which-key "media")
   "amp" '(emms-pause :which-key "play / pause")
   "amf" '(emms-play-file :which-key "play file")))

(use-package pulseaudio-control
  :commands pulseaudio-control-select-sink-by-name
)
